### Задачи

Создайте в отдельном файле функцию, переводящую градусы по шкале Цельсия в
градусы по шкале Фаренгейта по формуле: T F = 9/5 * T C + 32
```
def converter_to_f(cel):
    return 9/5 * cel + 32

print(converter_to_f(25))
```

Создайте в отдельном файле функции, вычисляющие площадь и периметр квадрата
```
def area(x):
    a = x * x
    print('Square area:', a)

def perimeter(x):
    p = x * 4
    print('Perimeter of the area:', p)

x = 2
area(x)
perimeter(x)
```

Напишите функцию в отдельном файле, вычисляющую среднее арифметическое трех
чисел
```
def average(a, b, c):
    return (a + b + c)/3

print(average(3, 5, 7))
```

Напишите функцию в отдельном файле, вычисляющую среднее арифметическое трех
чисел. Задайте значения по умолчанию, в момент вызова используйте ключевые
аргументы
```
def average(a, b=4, c=8):
    return (a + b + c)/3

print(average(3)
```

Попросите пользователя ввести свое имя и после этого отобразите на экране строку
вида: Привет, <имя>! Вместо <имя> должно указываться то, что пользователь ввел с
клавиатуры

```
name = (input("Как тебя зовут?" ))
print("Привет, "+ name + "!")
```

Напишите программу, определяющую сумму и произведение трех чисел (типа int,
float), введенных с клавиатуры
```
def sum(a, b, c):
    x = a + b + c
    return x

def mult(a, b, c):
    y = a * b * c
    return y

a = (float(input("Введите первое число: " )))
b = (float(input("Введите второе число: " )))
c = (float(input("Введите третье число: " )))

print("Сумма введенных чисел:", sum(a, b, c))
print("Произведение введенных чисел:", mult(a, b, c))
```

Как вычислить 1/x, чтобы не возникало ошибки деления на
нуль?
```
>>> x = 1
>>> x and 1/x
1.0
>>> x = 0
>>> x and 1/x
0
>>>
```

Напишите программу для определения индекса массы тела [BMI](https://tinyurl.com/y4c67rmj)
```
def bmi(m, h):
    i = m / h**2
    if i < 16:
        print("Выраженный дефицит массы тела")
    elif 16 < i < 18.5:
        print("Недостаточная (дефицит) масса тела")
    elif 18.5 < i < 24.99:
        print("Норма")
    elif 25 < i < 30:
        print("Избыточная масса тела (предожирение)")
    elif 30 < i < 35:
        print("Ожирение")
    elif 35 < i < 40:
        print("Ожирение резкое")
    elif i >= 40:
        print("Очень резкое ожирение")

m = float(input("Введите свою массу в килограммах: "))
h = float(input("Введите свой рост в метрах: "))

bmi(m, h)
```

Напишите собственную программу, определяющую максимальное из двух
введенных чисел. Реализовать в виде вызова собственной функции, возвращающей
большее из двух переданных ей чисел.
```
def compare(x, y):
    if x > y:
        print(x)
    elif y > x:
        print(y)
    else:
        print("Числа равны. Но некоторые равнее.")

x = float(input("Введите число: "))
y = float(input("Введите ещё одно число: "))

compare(x,y)
```
